tests/UKHO.ERPFacade.API.FunctionalTests/ERPFacadeExpectedXmlFiles/CancelCellWithExistingCellReplacement.xml

<?xml version="1.0" encoding="utf-16"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <Z_ADDS_MAT_INFO xmlns="urn:sap-com:document:sap:rfc:functions">
      <IM_MATINFO xmlns="">
        <CORRID>e61f5a69-c5a8-465b-6e56-08dccb3abf10</CORRID>
        <NOOFACTIONS>7</NOOFACTIONS>
        <RECDATE>20240920</RECDATE>
        <RECTIME>014134</RECTIME>
        <ORG>UKHO</ORG>
        <ACTIONITEMS>
          <Item>
            <ACTIONNUMBER>1</ACTIONNUMBER>
            <ACTION>REPLACED WITH ENC CELL</ACTION>
            <PRODUCT>ENC CELL</PRODUCT>
            <PRODTYPE>S57</PRODTYPE>
            <CHILDCELL>GB50382B</CHILDCELL>
            <PRODUCTNAME>GB50382B</PRODUCTNAME>
            <CANCELLED />
            <REPLACEDBY>GB100160</REPLACEDBY>
            <AGENCY />
            <PROVIDER />
            <ENCSIZE />
            <TITLE />
            <EDITIONNO />
            <UPDATENO />
            <UNITTYPE />
            <WEEKNO>202432</WEEKNO>
            <VALIDFROM>20240808</VALIDFROM>
            <CORRECTION>N</CORRECTION>
            <ACTIVEKEY />
            <NEXTKEY />
          </Item>
          <Item>
            <ACTIONNUMBER>2</ACTIONNUMBER>
            <ACTION>CHANGE ENC CELL</ACTION>
            <PRODUCT>ENC CELL</PRODUCT>
            <PRODTYPE>S57</PRODTYPE>
            <CHILDCELL>GB100160</CHILDCELL>
            <PRODUCTNAME>GB100160</PRODUCTNAME>
            <CANCELLED />
            <REPLACEDBY />
            <AGENCY>GB</AGENCY>
            <PROVIDER>1</PROVIDER>
            <ENCSIZE>large</ENCSIZE>
            <TITLE />
            <EDITIONNO />
            <UPDATENO />
            <UNITTYPE />
            <WEEKNO>202432</WEEKNO>
            <VALIDFROM>20240808</VALIDFROM>
            <CORRECTION>N</CORRECTION>
            <ACTIVEKEY />
            <NEXTKEY />
          </Item>
          <Item>
            <ACTIONNUMBER>3</ACTIONNUMBER>
            <ACTION>CHANGE AVCS UNIT OF SALE</ACTION>
            <PRODUCT>AVCS UNIT</PRODUCT>
            <PRODTYPE>S57</PRODTYPE>
            <CHILDCELL></CHILDCELL>
            <PRODUCTNAME>GB100160</PRODUCTNAME>
            <CANCELLED />
            <REPLACEDBY />
            <AGENCY>GB</AGENCY>
            <PROVIDER>1</PROVIDER>
            <ENCSIZE>large</ENCSIZE>
            <TITLE />
            <EDITIONNO />
            <UPDATENO />
            <UNITTYPE />
            <WEEKNO>202432</WEEKNO>
            <VALIDFROM>20240808</VALIDFROM>
            <CORRECTION>N</CORRECTION>
            <ACTIVEKEY />
            <NEXTKEY />
          </Item>
          <Item>
            <ACTIONNUMBER>4</ACTIONNUMBER>
            <ACTION>REMOVE ENC CELL FROM AVCS UNIT OF SALE</ACTION>
            <PRODUCT>AVCS UNIT</PRODUCT>
            <PRODTYPE>S57</PRODTYPE>
            <CHILDCELL>GB50382B</CHILDCELL>
            <PRODUCTNAME>GB50382B</PRODUCTNAME>
            <CANCELLED />
            <REPLACEDBY />
            <AGENCY />
            <PROVIDER />
            <ENCSIZE />
            <TITLE />
            <EDITIONNO />
            <UPDATENO />
            <UNITTYPE />
            <WEEKNO>202432</WEEKNO>
            <VALIDFROM>20240808</VALIDFROM>
            <CORRECTION>N</CORRECTION>
            <ACTIVEKEY />
            <NEXTKEY />
          </Item>
          <Item>
            <ACTIONNUMBER>5</ACTIONNUMBER>
            <ACTION>REMOVE ENC CELL FROM AVCS UNIT OF SALE</ACTION>
            <PRODUCT>AVCS UNIT</PRODUCT>
            <PRODTYPE>S57</PRODTYPE>
            <CHILDCELL>GB50382B</CHILDCELL>
            <PRODUCTNAME>PAYSF</PRODUCTNAME>
            <CANCELLED />
            <REPLACEDBY />
            <AGENCY />
            <PROVIDER />
            <ENCSIZE />
            <TITLE />
            <EDITIONNO />
            <UPDATENO />
            <UNITTYPE />
            <WEEKNO>202432</WEEKNO>
            <VALIDFROM>20240808</VALIDFROM>
            <CORRECTION>N</CORRECTION>
            <ACTIVEKEY />
            <NEXTKEY />
          </Item>
          <Item>
            <ACTIONNUMBER>6</ACTIONNUMBER>
            <ACTION>CANCEL ENC CELL</ACTION>
            <PRODUCT>ENC CELL</PRODUCT>
            <PRODTYPE>S57</PRODTYPE>
            <CHILDCELL>GB50382B</CHILDCELL>
            <PRODUCTNAME>GB50382B</PRODUCTNAME>
            <CANCELLED />
            <REPLACEDBY />
            <AGENCY />
            <PROVIDER />
            <ENCSIZE />
            <TITLE />
            <EDITIONNO />
            <UPDATENO />
            <UNITTYPE />
            <WEEKNO>202432</WEEKNO>
            <VALIDFROM>20240808</VALIDFROM>
            <CORRECTION>N</CORRECTION>
            <ACTIVEKEY />
            <NEXTKEY />
          </Item>
          <Item>
            <ACTIONNUMBER>7</ACTIONNUMBER>
            <ACTION>CANCEL AVCS UNIT OF SALE</ACTION>
            <PRODUCT>AVCS UNIT</PRODUCT>
            <PRODTYPE>S57</PRODTYPE>
            <CHILDCELL></CHILDCELL>
            <PRODUCTNAME>GB50382B</PRODUCTNAME>
            <CANCELLED />
            <REPLACEDBY />
            <AGENCY />
            <PROVIDER />
            <ENCSIZE />
            <TITLE />
            <EDITIONNO />
            <UPDATENO />
            <UNITTYPE />
            <WEEKNO>202432</WEEKNO>
            <VALIDFROM>20240808</VALIDFROM>
            <CORRECTION>N</CORRECTION>
            <ACTIVEKEY />
            <NEXTKEY />
          </Item>
        </ACTIONITEMS>
      </IM_MATINFO>
    </Z_ADDS_MAT_INFO>
  </soap:Body>
</soap:Envelope>